saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32F0xx_DFP</name>
  <description>STMicroelectronics STM32F0 Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="2.0.0" date="2018-01-18">
      This DFP works either with STM32CubeMX (STM32CubeMX V4.23.0 and STM32Cube_FW_F0 V1.9.0 or higher)
      or Standalone (no support for STM32CubeMX). STM32CubeMX is mandatory for use of CMSIS-Driver and MDK-Middleware.
      - New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' from the STM32Cube MX bundle for configuration of pins and clocks via STM32CubeMX.
      This pack only contains a subset of the files from STM32Cube_FW_F0 version 1.9.0  (ST Drivers, STM32Cube documentation and fonts).
      Updated documentation for STM32Cube Framework usage.
      Device support:
      - Updated device names to match STM32CubeMX notation
      - Added DBGMCU INI files configuring debug settings of the target for debug units without support for debug sequences
      - Updated documentation.
      CMSIS Driver:
      - Added CAN driver
      - Added I2C driver
      - Added SPI driver
      - Added UART/USART/IrDA/SmartCard driver
      - Added USB Device driver
      Board support:
      - Added STM32072B-EVAL and STM32091C-EVAL
      Example projects:
      - added emWin graphics library on STM32072B-EVAL and STM32091C-EVAL boards
      - added USB Device HID on STM32F072-Discovery Board
      - updated all examples to use STM32CubeMX integration
    </release>
    <release version="1.5.0" date="2016-04-04">
      Added new devices:
      - STM32F031E6, STM32F051T8
      - STM32F038E6, STM32F058T8, STM32F098CC, STM32F098RC, STM32F098VC
      Updated Device support files (STM32Cube_FW_F0_V1.5.0).
      Updated SVD files.
      Updated User manuals and datasheets.
      Updated example projects.
    </release>
    <release version="1.4.0" date="2015-02-23">
      Added board support:
      - STM32F030-Discovery board
      - STM32F072-Discovery board
      Updated board support:
      - STM32F051-Discovery board
      Updated Flash Option Byte Template
    </release>
    <release version="1.3.0" date="2015-01-13">
      Added: STM32F091xx, STM32F070xx, STM32F030xC devices.
      Updated: STM32F0xx device support files.
      Added: Flash Option Byte Template
    </release>
    <release version="1.2.0" date="2014-10-01">
      Added: Added missing devices.
            - STM32F038C6, STM32F038F6, STM32F038G6, STM32F038K6
            - STM32F048C6, STM32F048G6, STM32F048T6
            - STM32F058C8, STM32F058R8
    </release>
    <release version="1.1.0" date="2014-09-18">
      Added: Devices STM32F071V8, STM32F078RB.
      Added: STM32F0-Discovery board description and examples.
      Updated: CMSIS-CORE (Ver 1.4.0).
      Updated: device documentation.
    </release>
    <release version="1.0.3">
      Added: STM32F042 subfamily
    </release>
    <release version="1.0.2">
      Deleted: Book Entry "STM32F0 Discovery Board" from device section
    </release>
    <release version="1.0.1">
      Updated: device names changed in accordance to STMicroelectronics
    </release>
    <release version="1.0.0">
      First Release version of STM32F0 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F0</keyword>
    <keyword>STM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32F0 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>

      <book name="Documentation/dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>

      <description>
STMicroelectronics' STM32F0 series delivers 32-bit performance while providing the essentials of the STM32 family, particularly for cost-sensitive applications. STM32 F0 MCUs combine real-time performance, low-power operation, and the advanced architecture and peripherals associated with the STM32 platform available. This series of products is highly competitive in traditional 8-bit and 16-bit markets and eliminates the need to manage different architectures and the associated development overhead.
Typical applications include application control and user interfaces, handheld equipment, A/V receivers and digital TV, PC peripherals, gaming and GPS platforms, industrial applications, PLCs, inverters, printers, scanners, alarm systems, video intercoms, and HVACs

  - SRAM with HW parity checking
  - Timer with deadtime generation and emergency stop
      </description>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            Sequence("CheckID");
          </block>
        </sequence>

        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
          </block>

          <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021018, Read32(0x40021018) | 0x00400000);                   // Set RCC_APB2ENR.DBGMCUEN
  
            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB1_Fz);                                    // DBGMCU_APB1_FZ: Configure APB1 Peripheral Freeze Behavior
            Write32(0x4001580C, DbgMCU_APB2_Fz);                                    // DBGMCU_APB1_FZ: Configure APB2 Peripheral Freeze Behavior
          </block>
        </sequence>

        <!-- User-Defined Sequences -->
        <sequence name="CheckID">
          <block>
            __var pidr1 = 0;
            __var pidr2 = 0;
            __var jep106id = 0;
            __var ROMTableBase = 0;

            __ap = 0;      // AHB-AP

