saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
        <debugvars configfile="CMSIS/Debug/STM32F0x1_0x2_0x8.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <book name="Documentation/DM00031936.pdf" title="STM32F0x1/STM32F0x2/STM32F0x8 Reference Manual"/>
        <book name="Documentation/DM00104043.pdf" title="STM32F031 Data Sheet"/>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="Timer"         n="5"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2S"           n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="1"       m="6000000"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F031C4'  ***************************** -->
        <device Dname="STM32F031C4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="39"/>
          <variant Dvariant="STM32F031C4Tx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F031C6'  ***************************** -->
        <device Dname="STM32F031C6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="39"/>
          <variant Dvariant="STM32F031C6Tx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F031E6'  ***************************** -->
        <device Dname="STM32F031E6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="20"/>
          <variant Dvariant="STM32F031E6Yx">
            <feature type="CSP" n="25"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F031F4'  ***************************** -->
        <device Dname="STM32F031F4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="13"/>
          <variant Dvariant="STM32F031F4Px">
            <feature type="SOP" n="20"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F031F6'  ***************************** -->
        <device Dname="STM32F031F6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="13"/>
          <variant Dvariant="STM32F031F6Px">
            <feature type="SOP" n="20"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F031G4'  ***************************** -->
        <device Dname="STM32F031G4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="21"/>
          <variant Dvariant="STM32F031G4Ux">
            <feature type="QFP" n="28"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F031G6'  ***************************** -->
        <device Dname="STM32F031G6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="21"/>
          <variant Dvariant="STM32F031G6Ux">
            <feature type="QFP" n="28"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F031K4'  ***************************** -->
        <device Dname="STM32F031K4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="27"/>
          <variant Dvariant="STM32F031K4Ux">
            <feature type="QFP" n="32"/>
          </variant>
        </device>

