saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
        <!-- *************************  Device 'STM32F072RB'  ***************************** -->
        <device Dname="STM32F072RB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F072RBTx">
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="STM32F072RBIx">
            <feature type="BGA" n="64"/>
          </variant>
          <variant Dvariant="STM32F072RBHx">
            <feature type="BGA" n="64"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F072V8'  ***************************** -->
        <device Dname="STM32F072V8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="87"/>
          <variant Dvariant="STM32F072V8Hx">
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="STM32F072V8Tx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F072VB'  ***************************** -->
        <device Dname="STM32F072VB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="87"/>
          <variant Dvariant="STM32F072VBHx">
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="STM32F072VBTx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F078'  **************************** -->
      <subFamily DsubFamily="STM32F078">
        <processor Dclock="48000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xx.h" define="STM32F078xx"/>
        <debug svd="CMSIS/SVD/STM32F0x8.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F0x1_0x2_0x8.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <book name="Documentation/DM00031936.pdf" title="STM32F0x1/STM32F0x2/STM32F0x8 Reference Manual"/>
        <book name="Documentation/DM00109263.pdf" title="STM32F078 Data Sheet"/>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="4"       m="6000000"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="1"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F078CB'  ***************************** -->
        <device Dname="STM32F078CB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="36"/>
          <variant Dvariant="STM32F078CBTx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F078CBUx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F078CBYx">
            <feature type="CSP" n="49"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F078RB'  ***************************** -->
        <device Dname="STM32F078RB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="50"/>
          <variant Dvariant="STM32F078RBHx">
            <feature type="BGA" n="64"/>
          </variant>
          <variant Dvariant="STM32F078RBTx">
            <feature type="QFP" n="64"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F078VB'  ***************************** -->
        <device Dname="STM32F078VB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="86"/>
          <variant Dvariant="STM32F078VBHx">
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="STM32F078VBTx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F091'  **************************** -->
      <subFamily DsubFamily="STM32F091">
        <processor Dclock="48000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xx.h" define="STM32F091xC"/>
        <debug svd="CMSIS/SVD/STM32F0x1.svd"/>

