saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
        <!-- *************************  Device 'STM32F091VC'  ***************************** -->
        <device Dname="STM32F091VC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="88"/>
          <variant Dvariant="STM32F091VCHx">
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="STM32F091VCTx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F098'  **************************** -->
      <subFamily DsubFamily="STM32F098">
        <processor Dclock="48000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xx.h" define="STM32F098xx"/>
        <debug svd="CMSIS/SVD/STM32F0x8.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F0x1_0x2_0x8.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <book name="Documentation/DM00031936.pdf" title="STM32F0x1/STM32F0x2/STM32F0x8 Reference Manual"/>
        <book name="Documentation/DM00135027.pdf" title="STM32F098 Data Sheet"/>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="8"       m="6000000"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="CAN"           n="1"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F098CC'  ***************************** -->
        <device Dname="STM32F098CC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="37"/>
          <variant Dvariant="STM32F098CCTx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F098CCUx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F098RC'  ***************************** -->
        <device Dname="STM32F098RC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F098RCHx">
            <feature type="BGA" n="64"/>
          </variant>
          <variant Dvariant="STM32F098RCTx">
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="STM32F098RCYx">
            <feature type="CSP" n="64"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F098VC'  ***************************** -->
        <device Dname="STM32F098VC">
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="87"/>
          <variant Dvariant="STM32F098VCHx">
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="STM32F098VCTx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32F0">
      <description>STMicroelectronics STM32F0 Series Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F0*"/>
    </condition>
    <condition id="STM32F030x6">
      <description>STMicroelectronics STM32F030x6 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F030?[46]*"/>
    </condition>
