saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
    <condition id="STM32F098xx CMSIS">
      <description>STMicroelectronics STM32F098xx Devices and CMSIS-Core</description>
      <require condition="STM32F098xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + Compiler Conditions -->
    <condition id="STM32F0 ARMCC">
      <description>STMicroelectronics STM32F0 Devices and ARMCC Compiler</description>
      <require condition="STM32F0"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F030x6 ARMCC">
      <description>STMicroelectronics STM32F030x6 Devices and ARMCC Compiler</description>
      <require condition="STM32F030x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F030x8 ARMCC">
      <description>STMicroelectronics STM32F030x8 Devices and ARMCC Compiler</description>
      <require condition="STM32F030x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F030xC ARMCC">
      <description>STMicroelectronics STM32F030xC Devices and ARMCC Compiler</description>
      <require condition="STM32F030xC"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F031x6 ARMCC">
      <description>STMicroelectronics STM32F031x6 Devices and ARMCC Compiler</description>
      <require condition="STM32F031x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F038xx ARMCC">
      <description>STMicroelectronics STM32F038xx Devices and ARMCC Compiler</description>
      <require condition="STM32F038xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F042x6 ARMCC">
      <description>STMicroelectronics STM32F042x6 Devices and ARMCC Compiler</description>
      <require condition="STM32F042x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F048xx ARMCC">
      <description>STMicroelectronics STM32F048xx Devices and ARMCC Compiler</description>
      <require condition="STM32F048xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F051x8 ARMCC">
      <description>STMicroelectronics STM32F051x8 Devices and ARMCC Compiler</description>
      <require condition="STM32F051x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F058xx ARMCC">
      <description>STMicroelectronics STM32F058xx Devices and ARMCC Compiler</description>
      <require condition="STM32F058xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F070x6 ARMCC">
      <description>STMicroelectronics STM32F070x6 Devices and ARMCC Compiler</description>
      <require condition="STM32F070x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F070xB ARMCC">
      <description>STMicroelectronics STM32F070xB Devices and ARMCC Compiler</description>
      <require condition="STM32F070xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F071xB ARMCC">
      <description>STMicroelectronics STM32F071xB Devices and ARMCC Compiler</description>
      <require condition="STM32F071xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F072xB ARMCC">
      <description>STMicroelectronics STM32F072xB Devices and ARMCC Compiler</description>
      <require condition="STM32F072xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F078xx ARMCC">
      <description>STMicroelectronics STM32F078xx Devices and ARMCC Compiler</description>
      <require condition="STM32F078xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F091xC ARMCC">
      <description>STMicroelectronics STM32F091xC Devices and ARMCC Compiler</description>
      <require condition="STM32F091xC"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F098xx ARMCC">
      <description>STMicroelectronics STM32F098xx Devices and ARMCC Compiler</description>
      <require condition="STM32F098xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS + STM32CubeMX Conditions -->
    <condition id="STM32F0 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F0 Series Device, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32F0"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F030x6 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F030x6 Devices and CMSIS-Core</description>
      <require condition="STM32F030x6 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F030x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F030x8 Devices and CMSIS-Core</description>
      <require condition="STM32F030x8 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F030xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F030xC Devices and CMSIS-Core</description>
      <require condition="STM32F030xC CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F031x6 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F031x6 Devices and CMSIS-Core</description>
      <require condition="STM32F031x6 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F038xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F038xx Devices and CMSIS-Core</description>
      <require condition="STM32F038xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
