saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
    <condition id="STM32F042x6 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F042x6 Devices and CMSIS-Core</description>
      <require condition="STM32F042x6 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F048xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F048xx Devices and CMSIS-Core</description>
      <require condition="STM32F048xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F051x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F051x8 Devices and CMSIS-Core</description>
      <require condition="STM32F051x8 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F058xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F058xx Devices and CMSIS-Core</description>
      <require condition="STM32F058xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F070x6 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F070x6 Devices and CMSIS-Core</description>
      <require condition="STM32F070x6 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F070xB CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F070xB Devices and CMSIS-Core</description>
      <require condition="STM32F070xB CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F071xB CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F071xB Devices and CMSIS-Core</description>
      <require condition="STM32F071xB CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F072xB CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F072xB Devices and CMSIS-Core</description>
      <require condition="STM32F072xB CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F078xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F078xx Devices and CMSIS-Core</description>
      <require condition="STM32F078xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F091xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F091xC Devices and CMSIS-Core</description>
      <require condition="STM32F091xC CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F098xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F098xx Devices and CMSIS-Core</description>
      <require condition="STM32F098xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>

    <condition id="STM32F072xB CMSIS STM32CubeMX SPI">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX and CMSIS SPI driver</description>
      <require condition="STM32F072xB CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
    </condition>
    <condition id="STM32F091xC CMSIS STM32CubeMX SPI">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX and CMSIS SPI driver</description>
      <require condition="STM32F091xC CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
    </condition>

    <condition id="STM32F072B-EVAL CMSIS STM32CubeMX SPI GLCD">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX and SPI GLCD</description>
      <require condition="STM32F072xB CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
      <require Cclass="Graphics Display" Cgroup="STM32072B-EVAL" Cvariant="SPI IF"/>
    </condition>

    <condition id="STM32F091C-EVAL CMSIS STM32CubeMX SPI GLCD">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX and SPI GLCD</description>
      <require condition="STM32F091xC CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
      <require Cclass="Graphics Display" Cgroup="STM32072B-EVAL" Cvariant="SPI IF"/>
    </condition>
    
    <condition id="STM32F0 CMSIS STM32CubeMX Graphics SPI GLCD">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX, Graphics core and SPI GLCD</description>
      <require condition="STM32F0 CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"  Cgroup="SPI"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="SPI IF"/>
    </condition>
    
     <condition id="STM32F0 STARTUP CORTEX GPIO RCC FLASH">
      <description>STMicroelectronics STM32F0 devices, Startup and HAL CORTEX, GPIO, RCC and FLASH</description>
      <require condition="STM32F0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="CORTEX"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="FLASH"/>
    </condition>
    <condition id="STM32F0 HAL">
      <description>STMicroelectronics STM32F0 devices and HAL </description>
      <require condition="STM32F0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMMON"/>
    </condition>
    <condition id="STM32F0 HAL DMA">
      <description>STMicroelectronics STM32F0 Devices, HAL, and DMA peripheral</description>
      <require condition="STM32F0 HAL"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F0 LL">
      <description>STMicroelectronics STM32F0 devices and LL </description>
      <require condition="STM32F0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="COMMON"/>
    </condition>
    <condition id="STM32F0 STARTUP LL UTILS RCC PWR">
      <description>STMicroelectronics STM32F0 Device and LL</description>
      <require condition="STM32F0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>
