saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
      <component Cgroup="STM32Cube HAL" Csub="I2C" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Inter-integrated circuit (I2C) interface HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_I2C
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_i2c.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_i2c_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="I2S" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Interchip sound (I2S) interface HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_I2S
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_i2s.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="IRDA" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>IrDA HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_IRDA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_irda.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="IWDG" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Independent watchdog (IWDG) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_IWDG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_iwdg.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="PCD" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>USB Peripheral controller (PCD) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_PCD
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_pcd.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_pcd_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="PWR" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Power controller (PWR) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_PWR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_pwr.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_pwr_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="RCC" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Reset and clock control (RCC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_RCC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_rcc.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_rcc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="RTC" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Real-time clock (RTC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_RTC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_rtc.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_rtc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SMARTCARD" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Smartcard HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SMARTCARD
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_smartcard.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_smartcard_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SMBUS" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>System Management Bus (SMBUS) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SMBUS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_smbus.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SPI" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Serial peripheral interface (SPI) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SPI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_spi.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_spi_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="TIM" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Timers (TIM) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_TIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_tim.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_tim_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="TSC" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Touch Sensing Controller (TSC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_TSC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_tsc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="UART" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Universal asynchronous receiver transmitter (UART) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_UART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_uart.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_uart_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="USART" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Universal synchronous asynchronous receiver transmitter (USART) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_USART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_usart.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="WWDG" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Window watchdog (WWDG) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_WWDG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_wwdg.c"/>
        </files>
      </component>

      <!-- STM32F0xx LL Drivers -->
      <component Cgroup="STM32Cube LL" Csub="COMMON" Cversion="1.7.0" condition="STM32F0 STARTUP LL UTILS RCC PWR">
        <description>Common LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DRIVERS_USED
          #define RTE_DEVICE_LL_COMMON
        </RTE_Components_h>
        <files>
          <file category="include" name="Drivers/STM32F0xx_HAL_Driver/Inc/"/>
          <file category="include" name="Drivers/STM32F0xx_HAL_Driver/Inc/Legacy/"/>
          <file category="source"  name="MDK/Driver/stm32f0xx_ll.c"/>
          <file category="header"  name="MDK/Templates_LL/Inc/stm32_assert.h"       attr="template" select="STM32 assert template"/>
          <file category="header"  name="MDK/Templates_LL/Inc/stm32f0xx_it.h"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="source"  name="MDK/Templates_LL/Src/stm32f0xx_it.c"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="header"  name="MDK/Templates_LL/Inc/main.h"               attr="template" select="'main' module for STM32Cube"/>
          <file category="source"  name="MDK/Templates_LL/Src/main.c"               attr="template" select="'main' module for STM32Cube"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="ADC" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Analog-to-digital converter (ADC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_ADC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_adc.c"/>
        </files>
      </component>
