saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
      <component Cgroup="STM32Cube LL" Csub="COMP" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Analog Comparator (COMP) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_COMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_comp.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="CRC" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>CRC calculation unit (CRC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_CRC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_crc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="CRS" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Clock recovery system (CRS) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_CRS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_crs.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="DAC" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Digital-to-analog converter (DAC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DAC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_dac.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="DMA" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>DMA controller (DMA) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DMA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_dma.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="EXTI" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Extended interrupts and events controler (EXTI) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_EXTI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_exti.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="GPIO" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>General-purpose I/O (GPIO) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_GPIO
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_gpio.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="I2C" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Inter-integrated circuit (I2C) interface LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_I2C
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_i2c.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="PWR" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Power controller (PWR) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_PWR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_pwr.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="RCC"    Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Reset and clock control (RCC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_RCC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_rcc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="RTC" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Real-time clock (RTC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_RTC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_rtc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="SPI" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Serial peripheral interface (SPI) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_SPI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_spi.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="TIM" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Timers (TIM) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_TIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_tim.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="USART" Cversion="1.7.0"  condition="STM32F0 LL">
        <description>Universal synchronous asynchronous receiver transmitter (USART) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_USART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_usart.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="UTILS"  Cversion="1.7.0"  condition="STM32F0 LL">
        <description>UTILS LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_UTILS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_utils.c"/>
        </files>
      </component>        
    </bundle>

    <!-- CMSIS drivers -->
    <component Cclass="CMSIS Driver" Cgroup="CAN"                          Capiversion="1.0.0" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX">
      <description>CAN Driver for STM32F0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/bxCAN_STM32F0xx.c"/>
      </files>
    </component>
