saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F0xx_DFP.2.0.0.pdsc
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F072xB CMSIS STM32CubeMX SPI">
        <description>Graphic LCD driver for STMicroelectronics STM32072B-EVAL Board</description>
        <files>
          <file category="header"  name="MDK/Boards/ST/STM32072B-EVAL/Common/GLCD_Config.h"/>
          <file category="source"  name="MDK/Boards/ST/STM32072B-EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32072B-EVAL/Common/GLCD_SPI_STM32072B-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F072xB CMSIS STM32CubeMX">
      <description>LED driver for STMicroelectronics STM32072B-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32072B-EVAL/Common/LED_STM32072B-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F072xB CMSIS STM32CubeMX">
      <description>Button driver for STMicroelectronics STM32072B-EVAL Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32072B-EVAL/Common/Buttons_STM32072B-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="SPI IF" condition="STM32F072B-EVAL CMSIS STM32CubeMX SPI GLCD">
        <description>emWin LCD SPI Interface for STM32072B-EVAL  Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32072B-EVAL/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32091C-EVAL Board Support -->
    <bundle Cbundle="STM32091C-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32091C-EVAL Board</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F091xC CMSIS STM32CubeMX">
        <description>A/D Converter driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32091C-EVAL/Common/ADC_STM32091C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32F091xC CMSIS STM32CubeMX">
        <description>Joystick Interface for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32091C-EVAL/Common/Joystick_STM32091C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F091xC CMSIS STM32CubeMX SPI">
        <description>Graphic LCD driver for STMicroelectronics STM32091C-EVAL Board</description>
        <files>
          <file category="header"  name="MDK/Boards/ST/STM32091C-EVAL/Common/GLCD_Config.h"/>
          <file category="source"  name="MDK/Boards/ST/STM32091C-EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32091C-EVAL/Common/GLCD_SPI_STM32091C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F091xC CMSIS STM32CubeMX">
      <description>LED driver for STMicroelectronics STM32091C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32091C-EVAL/Common/LED_STM32091C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F091xC CMSIS STM32CubeMX">
      <description>Button driver for STMicroelectronics STM32091C-EVAL Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32091C-EVAL/Common/Buttons_STM32091C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="SPI IF" condition="STM32F091C-EVAL CMSIS STM32CubeMX SPI GLCD">
        <description>emWin LCD SPI Interface for STM32091C-EVAL  Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32091C-EVAL/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>
    
    <component Cclass="Graphics Display" Cgroup="STM32072B-EVAL" Cvariant="SPI IF" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX Graphics SPI GLCD">
      <description>LCD Configuration for MB895/S C03 LCD for STM32072B-EVAL Board</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32072B-EVAL/Common/LCDConf.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Graphics Display" Cgroup="STM32091C-EVAL" Cvariant="SPI IF" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX Graphics SPI GLCD">
      <description>LCD Configuration for MB895/S C03 LCD for STM32091C-EVAL Board</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32091C-EVAL/Common/LCDConf.c" attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

  <boards>
    <!-- STM32F030-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32F030-Discovery" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Discovery kit with STM32F030R8 MCU</description>
      <image small="MDK/Boards/ST/STM32F030-Discovery/Documents/STM32F030-Discovery_small.jpg"
             large="MDK/Boards/ST/STM32F030-Discovery/Documents/STM32F030-Discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1848/PF259100" title="STM32F030-Discovery Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F030-Discovery/Documents/32F030DISCOVERY_QSG.pdf" title="Quick Start Guide"/>
      <book category="other"     name="MDK/Boards/ST/STM32F030-Discovery/Documents/DM00092305.pdf" title="Data Brief"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F030-Discovery/Documents/MB1134.pdf"     title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F030R8"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F030"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F031"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F038"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="Accelerometer" n="1"          name="LIS302DL or LIS3DSH ST MEMS 3-axis accelerometer"/>
      <feature type="LED"       n="8"              name="LEDs: USB COM, 3.3 V Power, Two user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- STM32F051-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32F051-Discovery" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Discovery kit with STM32F051R8 MCU</description>
      <image small="MDK/Boards/ST/STM32F051-Discovery/Documents/STM32F051-Discovery_small.jpg"
             large="MDK/Boards/ST/STM32F051-Discovery/Documents/STM32F051-Discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1848/PF253215" title="STM32F051-Discovery Web Page"/>
      <book category="other"     name="MDK/Boards/ST/STM32F051-Discovery/Documents/DM00050631.pdf" title="Data Brief"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F051-Discovery/Documents/MB1034.pdf"     title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F051R8"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F051"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F058"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="2"              name="User, Reset"/>
      <feature type="LED"       n="4"              name="USB COM, 3.3 V Power, 2 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- STM32F072-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32F072-Discovery" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Discovery kit with STM32F072RB MCU</description>
      <image small="MDK/Boards/ST/STM32F072-Discovery/Documents/STM32F072-Discovery_small.jpg"
             large="MDK/Boards/ST/STM32F072-Discovery/Documents/STM32F072-Discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1848/PF259724" title="STM32F072-Discovery Web Page"/>
      <book category="other"     name="MDK/Boards/ST/STM32F072-Discovery/Documents/DM00099403.pdf" title="Data Brief"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F072-Discovery/Documents/MB1076.pdf"     title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F072RB"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F071"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F072"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F078"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="USB"       n="1"              name="User USB with Mini-B connector"/>
      <feature type="Button"    n="2"              name="User, Reset"/>
      <feature type="Gyro"      n="1"              name="L3GD20, ST MEMS motion sensor, 3-axis digital output gyroscope"/>
      <feature type="Touch"     n="1"              name="Linear Touch Sensor or four Touch Keys"/>
      <feature type="LED"       n="6"              name="USB COM, 3.3 V Power, 4 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- STM32072B-EVAL Board Support -->
    <board vendor="STMicroelectronics" name="STM32072B-EVAL" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>STM32072B-EVAL kit with STM32F072VB MCU</description>
      <image small="MDK/Boards/ST/STM32072B-EVAL/Documents/STM32072B-EVAL_small.jpg"
             large="MDK/Boards/ST/STM32072B-EVAL/Documents/STM32072B-EVAL_large.jpg"/>
      <book category="overview" name="http://www.st.com/content/st_com/en/products/evaluation-tools/product-evaluation-tools/mcu-eval-tools/stm32-mcu-eval-tools/stm32-mcu-eval-boards/stm32072b-eval.html" title="STM32072B-EVAL Web Page"/>
      <book category="other"    name="MDK/Boards/ST/STM32072B-EVAL/Documents/DM00104199.pdf" title="Data Brief"/>
      <book category="manual"   name="MDK/Boards/ST/STM32072B-EVAL/Documents/DM00104135.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F072VB"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F071"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F072"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F078"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD connected to SPI interface"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="1"              name="Push-Button: Tamper"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="ST-Link" connector="USB"/>
    </board>

